Revit 2027 API
SelectionFilterElement.IsEmpty Method
 Determines whether this filter's set is empty or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEmpty()
Public Function IsEmpty As Boolean
public:
bool IsEmpty()
member IsEmpty : unit -> bool
Return Value
Boolean
 True if the set is empty, otherwise false.
See Also
Reference
SelectionFilterElement Class
Autodesk.Revit.DB Namespace